In [1]:
import pandas as pd
df_one = pd.DataFrame(columns = ["Column 1", "Column 2"])
df_one

Empty DataFrame
Columns: [Column 1, Column 2]
Index: []

In [2]:
df_one.columns=["First", "Second"]
df_one

Empty DataFrame
Columns: [First, Second]
Index: []

In [3]:
new_data = {
    "First": [1, 2, "foo"],
    "Second": [4, 5, "bar"]
}
df_two = pd.DataFrame(new_data)
df_two

  First Second
0     1      4
1     2      5
2   foo    bar

In [4]:
df_combined = pd.concat([df_one, df_two])
df_combined

  First Second
0     1      4
1     2      5
2   foo    bar

In [5]:
data_for_one = {
    "First": [5,6,7, "Hello"],
    "Second": [10,11,12,"World"]
}
data_for_one

{'First': [5, 6, 7, 'Hello'], 'Second': [10, 11, 12, 'World']}

In [6]:
df_one = pd.DataFrame(data_for_one)
df_combined = pd.concat([df_one, df_two])
df_combined

   First Second
0      5     10
1      6     11
2      7     12
3  Hello  World
0      1      4
1      2      5
2    foo    bar

In [7]:
#fixes indices
df_combined.reset_index(drop=True, inplace=True)
df_combined

   First Second
0      5     10
1      6     11
2      7     12
3  Hello  World
4      1      4
5      2      5
6    foo    bar

In [8]:
column_data = {
    "Third": ["a", "b", "c"]
}
df_three = pd.DataFrame(column_data)
df_combined = pd.concat([df_combined, df_three], axis=1)
df_combined

   First Second Third
0      5     10     a
1      6     11     b
2      7     12     c
3  Hello  World   NaN
4      1      4   NaN
5      2      5   NaN
6    foo    bar   NaN